app/Http/Helpers.php

    function get_setting($setting)
    {
        // Verificar si los datos están almacenados en la sesión
        if (!Session::has('settings')) {
            // Si los datos no están almacenados en la sesión, llamar a la función get_settings()
            $settings = null;
            $integraciones = Integraciones::select('parametros')->where('tipo', 5)->first();
---
select `parametros` from `integraciones` where `tipo` = 5 limit 1

                    ->where('tipo', 5)
                    ->update($integraciones->toArray());

                DB::connection('empresa')->table('productos')->update([
                    'parametros_json' => json_encode($productos)
                ]);

                DB::connection('empresa')->table('productos_lineas')->update([
                    'parametros_json' => json_encode($lineas)
                ]);

                DB::connection('empresa')->table('productos_categorias')->update([
                    'parametros_json' => json_encode($categorias)
                ]);

                DB::connection('empresa')->table('productos_subcategoria')->update([
                    'parametros_json' => json_encode($subcategorias)
                ]);

                DB::connection('empresa')->table('productos_subgrupo')->update([
                    'parametros_json' => json_encode($subgrupos)
                ]);
---
update `productos` set `parametros_json` = '{\"rating\":0,\"destacado\":0,\"oferta\":0,\"inicio_oferta\":null,\"fin_oferta\":null}'
update `productos_lineas` set `parametros_json` = '{\"destacado\":0}'
update `productos_categorias` set `parametros_json` = '{\"destacado\":0}'
update `productos_subcategoria` set `parametros_json` = '{\"destacado\":0}'
update `productos_subgrupo` set `parametros_json` = '{\"destacado\":0}'

    function productosOferta()
    {
        $parametros = ParametrosEmpresa::first();
---
select * from `parametros_empresa` limit 1

            } else {
                $products = Producto::select('productos.productosid', 'productos.descripcion', 'productos_tarifas.precio', 'productos_imagenes.imagen', 'productos.parametros_json');
            }
            $products = $products->join('productos_tarifas', 'productos_tarifas.productosid', '=', 'productos.productosid')
                ->leftJoin('productos_imagenes', function ($products) {
                    $products->on('productos_imagenes.productosid', '=', 'productos.productosid')
                        ->where('productos_imagenes.principal', '=', "1");
                })
                ->where('productos_tarifas.tarifasid', '=', get_setting('tarifa_productos'))
                ->whereIn('productos.ecommerce_estado', array(1, 2))
                ->where('productos.venta', '=', '1')
                ->where('productos.servicio', '=', '0')
                ->where('productos.bien', '=', '0')
                ->where('productos_tarifas.medidasid', '=', DB::raw('productos.unidadinterna'))
                ->when(get_setting('productos_existencias') != "todos", function ($products) {
                    return $products->where('productos.existenciastotales', '>', '0');
                })
                ->where(DB::raw('JSON_EXTRACT(productos.parametros_json, "$.oferta")'), '=', 1)
                ->whereBetween(DB::raw('CURDATE()'), [DB::raw('replace(JSON_EXTRACT( productos.parametros_json, "$.inicio_oferta" ),' . "'" . '"' . "'" . ',""' . ') '), DB::raw('replace(JSON_EXTRACT( productos.parametros_json, "$.fin_oferta" ),' . "'" . '"' . "'" . ',""' . ') ')])
                ->get();
---
select `productos`.`productosid`, `productos`.`descripcion`, `productos_tarifas`.`precio`, `productos_imagenes`.`imagen`, `productos`.`parametros_json` from `productos` inner join `productos_tarifas` on `productos_tarifas`.`productosid` = `productos`.`productosid` left join `productos_imagenes` on `productos_imagenes`.`productosid` = `productos`.`productosid` and `productos_imagenes`.`principal` = '1' where `productos_tarifas`.`tarifasid` = 1 and `productos`.`ecommerce_estado` in (1, 2) and `productos`.`venta` = '1' and `productos`.`servicio` = '0' and `productos`.`bien` = '0' and `productos_tarifas`.`medidasid` = productos.unidadinterna and JSON_EXTRACT(productos.parametros_json, "$.oferta") = 1 and CURDATE() between replace(JSON_EXTRACT( productos.parametros_json, "$.inicio_oferta" ),'"',"")  and replace(JSON_EXTRACT( productos.parametros_json, "$.fin_oferta" ),'"',"")

    function grupoProductos($limit = null)
    {
        $grupo = get_setting('grupo_productos');

        switch ($grupo) {
            case 'lineas':
                $grupos = Lineas::select('productos_lineas.productos_lineasid as id', 'productos_lineas.descripcion', 'productos_lineas.imagen')
                    ->join('productos', 'productos.productos_lineasid', '=', 'productos_lineas.productos_lineasid');
                break;
            case 'categorias':
                $grupos = Categorias::select('productos_categorias.productos_categoriasid as id', 'productos_categorias.descripcion', 'productos_categorias.imagen')
                    ->join('productos', 'productos.productos_categoriasid', '=', 'productos_categorias.productos_categoriasid');
                break;
            case 'subcategorias':
                $grupos = Subcategorias::select('productos_subcategoria.productos_subcategoriasid as id', 'productos_subcategoria.descripcion', 'productos_subcategoria.imagen')
                    ->join('productos', 'productos.productos_subcategoriasid', '=', 'productos_subcategoria.productos_subcategoriasid');
                break;
            case 'subgrupos':
                $grupos = Subgrupos::select('productos_subgrupo.productos_subgruposid as id', 'productos_subgrupo.descripcion', 'productos_subgrupo.imagen')
                    ->join('productos', 'productos.productos_subgruposid', '=', 'productos_subgrupo.productos_subgruposid');
                break;
            default:
                break;
        }
        $grupos = $grupos->whereIn('productos.ecommerce_estado', array(1, 2))
            ->where('productos.venta', '=', '1')
            ->where('productos.servicio', '=', '0')
            ->where('productos.bien', '=', '0')
            ->when(get_setting('productos_existencias') != "todos", function ($products) {
                return $products->where('productos.existenciastotales', '>', '0');
            })
            ->groupBy('id');
---
select `productos_categorias`.`productos_categoriasid` as `id`, `productos_categorias`.`descripcion`, `productos_categorias`.`imagen` from `productos_categorias` inner join `productos` on `productos`.`productos_categoriasid` = `productos_categorias`.`productos_categoriasid` where `productos`.`ecommerce_estado` in (1, 2) and `productos`.`venta` = '1' and `productos`.`servicio` = '0' and `productos`.`bien` = '0' group by `id` order by `descripcion` asc