app/Http/Controllers/HistorialPedidosController.php

select count(*) as aggregate from `pedidos` where `clientesid` = 37452 and `usuariocreacion` = 'Ecommerce'
---
    public function index()
    {
        $orders = Pedidos::where('clientesid', Auth::user()->clientesid)
            ->where('usuariocreacion', 'Ecommerce')
            ->orderBy('fechacreacion', 'desc')->paginate(9);