app/Http/Controllers/HistorialFacturasController.php

    public function index()
    {
        $orders = Facturas::where('clientesid', Auth::user()->clientesid)
            ->where('usuariocreacion', 'Ecommerce')
            ->orderBy('fechacreacion', 'desc')->paginate(9);
---
select count(*) as aggregate from `facturas` where `clientesid` = 37452 and `usuariocreacion` = 'Ecommerce'