app/Http/Controllers/HomeController.php

    public function ajax_search(Request $request)
    {
        $parametros = ParametrosEmpresa::first();
---
select * from `parametros_empresa` limit 1