app/Http/Controllers/HomeController.php

    public function process_login(Request $request)
    {

        $identificacionIngresada = substr($request->identificacion, 0, 10);
        $cliente = Clientes::where(DB::raw('substr(identificacion, 1, 10)'), $identificacionIngresada)->first();
---
select * from `clientes` where substr(identificacion, 1, 10) = '2300107287' limit 1

    public function load_featured_section()
    {
        //cargar seccion de productos destacados
        $parametros = ParametrosEmpresa::first();
---
select * from `parametros_empresa` limit 1

    public function load_best_selling_section()
    {
        $fecha_inicio = Carbon::now()->subDays(30); // 30 días hacia atrás desde la fecha actual
        // Subconsulta para las ventas
        $ventasSubquery = DB::table('facturas_detalles as fd')
            ->select('fd.productosid', DB::raw('SUM(CASE WHEN (f.sri_documentoscodigo = \'04\') THEN (fd.cantidad * -1) ELSE fd.cantidad END) AS total_cantidad'))
            ->join('facturas as f', 'fd.facturasid', '=', 'f.facturasid')
            ->where('f.emision', '>=', Carbon::now()->subDays(30))
            ->groupBy('fd.productosid')
            ->orderBy('total_cantidad', 'desc')
            ->limit(10);

        $parametros = ParametrosEmpresa::first();
---
select * from `parametros_empresa` limit 1

    public function product($productosid)
    {
        //presentar un producto
        $parametros = ParametrosEmpresa::first();
        $detallesProducto = Producto::where('productosid', $productosid)->first();
        $precioProducto2 = "";
        if ($parametros->tipopresentacionprecios == 1) {
            $precioProducto = ProductoTarifa::select('productos_tarifas.precioiva as precio', 'productos_tarifas.factor');
        } else {
            $precioProducto = ProductoTarifa::select('productos_tarifas.precio', 'productos_tarifas.factor');
        }
        $precioProducto = $precioProducto->join('productos', 'productos.productosid', '=', 'productos_tarifas.productosid')
            ->where([
                ['productos_tarifas.productosid', $productosid],
                ['productos_tarifas.tarifasid', '=', get_setting('tarifa_productos')],
                ['productos_tarifas.medidasid', '=', DB::raw('productos.unidadinterna')]
            ])
            ->first();

        $imagenProducto =  ProductoImagen::select('productos_imagenes.imagen', 'productos_imagenes.medidasid')
            ->where('productos_imagenes.productosid', '=', $productosid)
            ->where('productos_imagenes.ecommerce_visible', '=', '1')
            ->orderBy('productos_imagenes.medidasid')
            ->get();

        $comentarios = Comentarios::select('ecommerce_comentarios.comentario', 'ecommerce_comentarios.valoracion', 'ecommerce_comentarios.fechacreacion', 'clientes.razonsocial')
            ->join('clientes', 'clientes.clientesid', '=', 'ecommerce_comentarios.clientesid')
            ->where('ecommerce_comentarios.productosid', $productosid)
            ->where('ecommerce_comentarios.estado', 1)
            ->get();

        $numerocomentarios = Comentarios::where('ecommerce_comentarios.productosid', $productosid)
            ->where('ecommerce_comentarios.estado', 1)
            ->count();

        $medidas = ProductoTarifa::select('medidas.descripcion', 'medidas.medidasid', 'productos_tarifas.factor')
            ->join('medidas', 'medidas.medidasid', '=', 'productos_tarifas.medidasid')
            ->where('productos_tarifas.productosid', '=', $productosid)
            ->groupBy('medidas.descripcion', 'medidas.medidasid', 'productos_tarifas.factor')
            ->orderBy('medidas.medidasid')
            ->get();
---
select * from `parametros_empresa` limit 1
select * from `productos` where `productosid` = '280' limit 1
select `productos_tarifas`.`precio`, `productos_tarifas`.`factor` from `productos_tarifas` inner join `productos` on `productos`.`productosid` = `productos_tarifas`.`productosid` where (`productos_tarifas`.`productosid` = '280' and `productos_tarifas`.`tarifasid` = 1 and `productos_tarifas`.`medidasid` = productos.unidadinterna) limit 1
select `productos_imagenes`.`imagen`, `productos_imagenes`.`medidasid` from `productos_imagenes` where `productos_imagenes`.`productosid` = '280' and `productos_imagenes`.`ecommerce_visible` = '1' order by `productos_imagenes`.`medidasid` asc
select `ecommerce_comentarios`.`comentario`, `ecommerce_comentarios`.`valoracion`, `ecommerce_comentarios`.`fechacreacion`, `clientes`.`razonsocial` from `ecommerce_comentarios` inner join `clientes` on `clientes`.`clientesid` = `ecommerce_comentarios`.`clientesid` where `ecommerce_comentarios`.`productosid` = '280' and `ecommerce_comentarios`.`estado` = 1
select count(*) as aggregate from `ecommerce_comentarios` where `ecommerce_comentarios`.`productosid` = '280' and `ecommerce_comentarios`.`estado` = 1
select `medidas`.`descripcion`, `medidas`.`medidasid`, `productos_tarifas`.`factor` from `productos_tarifas` inner join `medidas` on `medidas`.`medidasid` = `productos_tarifas`.`medidasid` where `productos_tarifas`.`productosid` = '280' group by `medidas`.`descripcion`, `medidas`.`medidasid`, `productos_tarifas`.`factor` order by `medidas`.`medidasid` asc

                $id = Lineas::where($grupoid, $detallesProducto->productos_lineasid)->first()->productos_lineasid;
                break;
            case 'categorias':
                $id = Categorias::where($grupoid, $detallesProducto->productos_categoriasid)->first()->productos_categoriasid;
---
select * from `productos_categorias` where `productos_categoriasid` = 1 limit 1

            }
        }

        $relacionados = $relacionados->join('productos_tarifas', 'productos_tarifas.productosid', '=', 'productos.productosid')
            ->leftJoin('productos_imagenes', function ($products) {
                $products->on('productos_imagenes.productosid', '=', 'productos.productosid')
                    ->where('productos_imagenes.principal', '=', "1");
            })
            ->when(get_setting('productos_existencias') != "todos", function ($products) {
                return $products->where('productos.existenciastotales', '>', '0');
            })
            ->whereIn('productos.ecommerce_estado', array(1, 2))
            ->where([
                ['productos.' . $grupoid, '=', $id],
                ['productos_tarifas.tarifasid', '=', get_setting('tarifa_productos')],
                ['productos.venta', '=', '1'],
                ['productos.servicio', '=', '0'],
                ['productos.bien', '=', '0'],
                ['productos_tarifas.medidasid', '=', DB::raw('productos.unidadinterna')]
            ])
            ->orderByRaw('RAND()')
            ->paginate(10);
---
select count(*) as aggregate from `productos` inner join `productos_tarifas` on `productos_tarifas`.`productosid` = `productos`.`productosid` left join `productos_imagenes` on `productos_imagenes`.`productosid` = `productos`.`productosid` and `productos_imagenes`.`principal` = '1' where `productos`.`ecommerce_estado` in (1, 2) and (`productos`.`productos_categoriasid` = 1 and `productos_tarifas`.`tarifasid` = 1 and `productos`.`venta` = '1' and `productos`.`servicio` = '0' and `productos`.`bien` = '0' and `productos_tarifas`.`medidasid` = productos.unidadinterna)

    public function search(Request $request, $id = null)
    {
        $parametros = ParametrosEmpresa::first();
---
select * from `parametros_empresa` limit 1

    public function ajax_search(Request $request)
    {
        $parametros = ParametrosEmpresa::first();
---
select * from `parametros_empresa` limit 1

    public function variant_price(Request $request)
    {
        if (get_setting('controla_stock') == 1) {
            $cantidad = Producto::select('existenciastotales')->where('productosid', $request->id)->first();
            $cantidadFinal = $cantidad->existenciastotales;
        } else {
            $cantidadFinal = 0;
        }

        $parametros = ParametrosEmpresa::first();
        $producto = ProductoTarifa::select('productos_tarifas.precio', 'productos_tarifas.precioiva', 'productos_tarifas.factor');

        if (Auth::check()) {
            $producto = $producto->where('productos_tarifas.productosid', '=', $request->id)
                ->where('productos_tarifas.tarifasid', '=', auth()->user()->tarifasid)
                ->where('productos_tarifas.medidasid', '=', $request->medidasid)
                ->first();
            if (get_setting('controla_stock') == 2) {
                if ($request->cantidadCambio == null) {
                    $cantidad = MovimientosInventariosAlmacenes::where('productosid', $request->id)
                        ->where('almacenesid', $request->variableinicio)
                        ->first();
                }
                if ($cantidad) {
                    $cantidadFinal = $cantidad->existencias;
                } else {
                    $cantidadFinal  = 0;
                }
            }

            $producto2 = ProductoTarifa::select('productos_tarifas.precio', 'productos_tarifas.precioiva', 'productos_tarifas.factor')
                ->where('productos_tarifas.productosid', '=', $request->id)
                ->where('productos_tarifas.tarifasid', '=', get_setting('tarifa_productos'))
                ->where('productos_tarifas.medidasid', '=', $request->medidasid)
                ->first();
---
select * from `parametros_empresa` limit 1
select `productos_tarifas`.`precio`, `productos_tarifas`.`precioiva`, `productos_tarifas`.`factor` from `productos_tarifas` where `productos_tarifas`.`productosid` = '280' and `productos_tarifas`.`tarifasid` = 1 and `productos_tarifas`.`medidasid` = '1' limit 1

    public function estado_cartera()
    {
        $documentos = DB::connection('empresa')->table('cuentasporcobrar')
            ->select('cuentasporcobrar.secuencial', 'cuentasporcobrar.documentosid AS documentoid', 'cuentasporcobrar.secuencial AS secuencia', DB::raw('max(cuentasporcobrar.importe) AS valor'), DB::raw('SUM(cuentasporcobrar.importe) AS saldo'), DB::raw('CASE WHEN MAX(cuentasporcobrar.importe)=0 THEN cuentasporcobrar.emision ELSE cuentasporcobrar.emision END AS emision'), DB::raw('CASE WHEN MAX(cuentasporcobrar.importe)=0 THEN cuentasporcobrar.vence ELSE cuentasporcobrar.vence END AS vence'), DB::raw('case WHEN DATEDIFF(now(),cuentasporcobrar.vence) > 0 then DATEDIFF(now(),cuentasporcobrar.vence) ELSE 0 END as diasvence'))
            ->where('cuentasporcobrar.clientesid', auth()->user()->clientesid)
            ->groupBy('cuentasporcobrar.secuencial', 'cuentasporcobrar.documentosid')
            ->orderBy('emision', 'desc')
            ->paginate(9);
---
select `cuentasporcobrar`.`secuencial`, `cuentasporcobrar`.`documentosid` as `documentoid`, `cuentasporcobrar`.`secuencial` as `secuencia`, max(cuentasporcobrar.importe) AS valor, SUM(cuentasporcobrar.importe) AS saldo, CASE WHEN MAX(cuentasporcobrar.importe)=0 THEN cuentasporcobrar.emision ELSE cuentasporcobrar.emision END AS emision, CASE WHEN MAX(cuentasporcobrar.importe)=0 THEN cuentasporcobrar.vence ELSE cuentasporcobrar.vence END AS vence, case WHEN DATEDIFF(now(),cuentasporcobrar.vence) > 0 then DATEDIFF(now(),cuentasporcobrar.vence) ELSE 0 END as diasvence from `cuentasporcobrar` where `cuentasporcobrar`.`clientesid` = 37452 group by `cuentasporcobrar`.`secuencial`, `cuentasporcobrar`.`documentosid` order by `emision` desc limit 9 offset 0

    public function detalle_documento(Request $request)
    {

        $documentoid = $request->documentoid;
        $detalles = DB::connection('empresa')->table('cuentasporcobrar')
            ->select('cuentasporcobrar.emision AS emision', 'cuentasporcobrar.importe AS importe', DB::raw('CASE WHEN cuentasporcobrar.tipo = "AB" THEN "ABONO" WHEN cuentasporcobrar.tipo = "FC" THEN "FACTURA" WHEN cuentasporcobrar.tipo = "NC" THEN "NOTA CREDITO" WHEN cuentasporcobrar.tipo = "IR" THEN "RETENCION"  WHEN cuentasporcobrar.tipo = "ND" THEN "NOTA DEBITO" END AS tipo'))
            ->where('cuentasporcobrar.documentosid', $request->documentoid)
            ->where('cuentasporcobrar.clientesid', auth()->user()->clientesid)
            ->get();
---
select `cuentasporcobrar`.`emision` as `emision`, `cuentasporcobrar`.`importe` as `importe`, CASE WHEN cuentasporcobrar.tipo = "AB" THEN "ABONO" WHEN cuentasporcobrar.tipo = "FC" THEN "FACTURA" WHEN cuentasporcobrar.tipo = "NC" THEN "NOTA CREDITO" WHEN cuentasporcobrar.tipo = "IR" THEN "RETENCION"  WHEN cuentasporcobrar.tipo = "ND" THEN "NOTA DEBITO" END AS tipo from `cuentasporcobrar` where `cuentasporcobrar`.`documentosid` = '51' and `cuentasporcobrar`.`clientesid` = 37452